# ══════════════════════════════════════════════════════════════════════════════
#  Brewfile — Terminal Powerhouse Dependencies
# ══════════════════════════════════════════════════════════════════════════════

# Terminal emulator
cask "ghostty"

# Fonts
cask "font-monaspace"
cask "font-fira-code"

# Modern CLI replacements
brew "bat"           # cat replacement with syntax highlighting
brew "eza"           # ls replacement with icons & git status
brew "fd"            # find replacement, fast & user-friendly
brew "fzf"           # fuzzy finder for everything
brew "ripgrep"       # grep replacement, blazing fast
brew "zoxide"        # cd replacement, learns your habits
brew "git-delta"     # git diff viewer with syntax highlighting

# Shell & prompt
brew "starship"      # cross-shell prompt, fast & configurable

# Git tools
brew "lazygit"       # terminal UI for git
brew "gh"            # GitHub CLI

# Dev environment
brew "neovim"        # terminal editor
brew "mise"          # universal version manager (node, python, ruby, go...)
brew "atuin"         # shell history with search & sync

# File management
brew "yazi"          # terminal file manager with image preview

# System monitoring
brew "btop"          # system monitor (better top/htop)
